testapp/app/controllers/owners_controller.rb

  def create
    @owner = Owner.new(owner_params)

    respond_to do |format|
      if @owner.save
---
INSERT INTO "owners" ("name", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "MyString"], ["title", "MyString"], ["created_at", "2017-12-05 07:53:27.171096"], ["updated_at", "2017-12-05 07:53:27.171096"]]

  def destroy
    @owner.destroy
---
DELETE FROM "owners" WHERE "owners"."id" = ?  [["id", 980190962]]

    def set_owner
      @owner = Owner.find(params[:id])
---
SELECT  "owners".* FROM "owners" WHERE "owners"."id" = ? LIMIT ?  [["id", 980190962], ["LIMIT", 1]]