testapp/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "age", "father_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "MyString"], ["age", 1], ["father_name", "MyString"], ["created_at", "2017-12-05 07:53:27.089310"], ["updated_at", "2017-12-05 07:53:27.089310"]]